[
    {
        "imgIcon": "https://kahoot.com/files/2020/10/FBTwitter_Coco_1020-600x338.png",
        "title": "Disney and Kahoot! make fall celebrations fun and spirited with a new Kahoot! Academy collection",
        "describe": "Fan-favorite Disney characters bring magic to Halloween and Día de los Muertos in a new, themed collection on Kahoot! Academy.",
        "content":"<a href=''>Lee este artículo en español aquí.</a><br /><br />This fall season, many are looking for new ways to celebrate Halloween and Día de los Muertos while staying safe and socially distanced. To bring magic and fun to celebrations around the world, we are excited to launch a new <a href=''>Kahoot! Academy</a> collection of games for Halloween and Día de los Muertos, in cooperation with Disney! <br /><img src='https://kahoot.com/files/2020/10/blog_Daisy-and-friends.jpg' width='800px'></img> <br /> <br />  Created for Disney fans of all ages, these games will unlock bucketfuls of fall holiday fun with in-person and virtual audiences alike. Explore the new collection on the <a href=''> Disney Premium partner page</a>, and see how much your audience knows about the upcoming holidays and featured Disney characters! <a href=''> <b> This is the first collection of games </b> </a> to be released from the recently-announced agreement between <a href=''> Kahoot! and Disney.</a> <br /> This <a href=''>collection</a> features beloved characters and games that Disney fans of all ages will enjoy. Play Halloween-themed trivia with classic characters like Mickey and Minnie Mouse, and learn about the traditions of Día de los Muertos, the Day of the Dead with our friends from the film Coco. <br /> <br /> All of the kahoots are also available en español for Spanish speakers and learners. <br /> The new collection of learning games are available for free on Kahoot! Academy, the newly-launched knowledge platform and online community, which allows educators and publishers to share and access content that supports engaging and meaningful learning experiences for learners of all ages. All Kahoot! Academy content is available for users of Kahoot!, both on the web and in the mobile app. <br /> <br /> The kahoots can easily be played in-person or virtually via Zoom or your favorite teleconferencing service. They can even be sent as challenges that users can play at their own pace. Whether you’re celebrating Halloween with your family, friends, co-workers or students, this new kahoot collection from Disney and Kahoot! Academy is sure to get you all in the festive spirit to make this  year’s celebration eerily awesome."
    },
    {
        "imgIcon": "https://kahoot.com/files/2020/09/KDISNEY_BlogImage2_KJ-adaptedFeaturedSpot-600x338.png",
        "title": "Disney fan-favorites add magic to curriculum-aligned collections on Kahoot! Academy",
        "describe": "Kahoot! makes learning awesome with familiar characters from Disney in new curriculum-aligned kahoot collections on Kahoot! Academy.",
        "content":"As students in the Northern Hemisphere head back to school, many in a virtual learning environment, educators and parents are looking for ways to keep students engaged in learning. To support learners of all ages globally, We are excited to launch a new series of <a href=''> Kahoot! Academy </a>premium curriculum collections with characters from beloved Disney franchises. <br /> <br /> <img src='https://kahoot.com/files/2020/09/KahootDisney_C3.png' width='800px' /> <br /> <br /> The new collections will feature a diverse series of ready-to-play kahoots featuring beloved characters from Disney, Pixar and Star Wars franchises, including Frozen, Cars and more. Available for free to teachers, students and parents, the collections to be launched in Q4 2020 will cover a wide range of key K-12 subjects and will be available in multiple languages for learners around the world, including Spanish, German, French, Chinese (Mandarin), Hindi and many others. <br /> Users will be able to access the new collections of curriculum-aligned learning games for free on Kahoot! Academy, the newly-launched knowledge platform, online community, and marketplace which allows educators and publishers to share and access content that supports engaging and meaningful learning experiences for learners of all ages worldwide. All Kahoot! Academy content is available for all users of Kahoot! <br /> This agreement with Disney is the latest and largest scale collaboration yet between Disney and Kahoot!, which began in 2017 when Kahoot! was selected to be part of the prestigious Disney Accelerator program. <br /> In July, Kahoot! announced its <a href=''> collaboration with Disney’s Marvel Entertainment </a> to create a collection of learning games featuring Marvel Comics characters, now <a href=''>available to play </a> on the Kahoot! website and mobile app. Kahoot! collaborated with <a href=''> Disney Youth Programs</a> in 2019 to launch a series of Disney-themed learning games, now played by millions of learners globally. Kahoot! also teamed up with <a href=''> National Geographic </a>to launch a popular collection of learning games designed to promote geographic literacy. <br /> In these challenging times, educators across the globe are facing the prospect of keeping students engaged and interacting while delivering academic content, whether through online learning or maintaining social distance in the classroom. We are excited to combine the strength of the Kahoot! platform with the magic of Disney to provide educators, students and their families with interactive and high-quality learning experiences to continue to make learning awesome."
    },
    {
        "imgIcon": "https://kahoot.com/files/2020/04/PoioDB-BlogImage_2020-03-600x272.jpg",
        "title": "Learn at home: Immersive learn-to-read game Poio by Kahoot! is now available in the U.S.",
        "describe": "Kahoot! extends its learning app offerings as Poio joins educational math studio DragonBox empowering millions of children to learn at home.",
        "content":"We are excited to announce today that Kahoot! is extending its toolset of learning apps by launching the U.S. version of the learn-to-read app Poio. Poio joins educational math studio DragonBox as part of Kahoot!’s unified brand that makes learning at home awesome and fun for millions of children. <br /> With the recent surge of remote learning and educational gaming tools at home, this couldn’t be a better time to offer Poio in the U.S. alongside DragonBox and Kahoot! for children and their parents to learn at home. <h1>Learning at home with Poio</h1> Poio is an immersive game designed for children aged three to eight to learn <b>how to read through play and exploration</b>. The game is so intuitive that they can practice without the need for support from parents or teachers, which makes it a perfect tool for learning at home. <br /> Here’s what Joanne Sains, mother and teacher, said about Poio after testing it out with her four-year-old son: <br /> <i>“Using Poio is an entirely different approach as it doesn’t require me to make-up a game in order to interest my child. Poio is intuitive and can be accessed even by younger children. The gameplay is fast and very responsive. The learning is incidental and that’s what makes Poio unique”. </i> <br /> <img src='https://kahoot.com/files/2020/04/Poio-Joanne-Sains.jpg' width='800px' /> <br /> The app is developed together with educators in order to blend adventurous play with a <b>large amount of phonics training</b> that children get exposed to constantly. By putting play first and making the learning a byproduct of playing, the game triggers children’s curiosity and motivation to <b>practice spelling and phonetics </b> on their own. <br /> The story-based game adapts to each child’s skill level so all children can enjoy learning the fundamentals of reading at their own pace. While the child is progressing through the game, parents receive email reports to <b>keep track of their child’s achievements</b>. <br /> Poio is already being used by more than 100,000 parents in Europe to help their children crack the reading code and therefore we are very happy that now parents in the U.S. and everywhere else can do the same. <br /> <br /><h1>What is DragonBox?</h1> DragonBox is a collection of five <b>math-based learning apps</b>, each of them offering a unique experience that is interactive and engaging to give children a powerful digital learning experience. <br /> The apps cover a wide range of math topics that go from foundation math for young kids (DragonBox Numbers) to Algebra (DragonBox Algebra). DragonBox is internationally recognized for its innovative and engaging games, as they go beyond practicing equations to help children visualize counting and numbers and <b> learn basic math functions on their own</b>. <br /> DragonBox is developed by a committed and passionate group of educational experts, teachers, game developers, cognitive scientists, writers and artists – many of whom are parents, too. <br /> So try out these apps to teach your child the importance of numbers during Mathematics and Statistics Awareness Month in April! <br /> <h1>Where can you find these learning apps?</h1> Have a look at DragonBox’s collection of math apps <a href=''> here</a>, and learn more about Poio <a href=''>here</a>. <br /> The Poio, DragonBox and Kahoot! apps are all available for download on both in the App Store and Google Play worldwide."
    },
    {
        "imgIcon": "https://kahoot.com/files/2020/04/Skype_blog-cover_04-2020-600x338.png",
        "title": "Host a kahoot via Skype to connect with family, friends, and colleagues",
        "describe": "Playing Kahoot! online is a popular way for families, groups of friends, teachers, and company employees to connect and spend some social time together. Learn how you can facilitate a quiz session by playing Kahoot! via Skype.",
        "content":"Virtual quizzes are taking over the internet as lockdown continues in many countries, and we’re all looking for new ways to connect and get a bit of entertainment. The quiz format has proven to <b> engage players of all ages</b> and works great in an online setting. <br /> Family and friends quiz nights via video calls, work-from-home office trivia, virtual sessions for school students and their parents – these new forms of activities are on the rise, bringing some light-hearted social interaction while people can’t meet in person. We’re happy to see that many are choosing Kahoot! to facilitate these activities by <b>playing via a video call</b>. <br /> One of the popular video call solutions that can help you run your virtual quiz night is Skype. Here’s how you <b> host a game show from your living room</b> with Kahoot! and Skype: <br /> <ol> <li> Before you start your meeting, log in to your Kahoot! account and open a kahoot you’d like to host </li> <li> Log in to your Skype account in the desktop app or on the web. Select the contact you want to call and then select the video call button. To make a group call, simply add another participant </li> <li> Once participants have joined your video call, click <b> Play </b> and <b> Host live </b> to launch the kahoot in your web browser so the lobby is showing with the game PIN </li> <li> Select the screen sharing button in the Skype toolbar. (Please note that screen sharing with Skype for Web is only available in Chrome) </li> <li> When participants see the game PIN on your shared screen, they use a second device to use this PIN and join the game – for example, a mobile phone </li> <li>Host the kahoot as usual while your screen is shared</li> </ol> <h1>Pro tips:</h1> <ul> <li> Choose a kahoot that includes images and video for a better game experience </li> <li> Take pauses between some of the questions to discuss and interact with each other </li> <li> Connecting several families on your video call? They can use one device to join the game and compete in <b>Team Mode</b> </li> </ul> Looking for an engaging kahoot for your next virtual session? Here are some tips on how to find relevant games: <iframe width='720' height='406' src='https://www.youtube.com/embed/N45H81KSNbE' allow='accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture'></iframe><br /> Have you tried playing Kahoot! via video with friends, family members, colleagues, or students? Share your experience on <a href=''> <u> <b> Twitter </b> </u> </a> or <a href=''> <u> <b> Linkedin </b> </u> </a> !"
    },
    {
        "imgIcon": "https://kahoot.com/files/2020/03/BlogCover-ImagesAsAnswers-600x338.png",
        "title": "New feature: Add images as answers to engage pre-readers and students who struggle with text!",
        "describe": "As one of our top requests, you can now use images as answer alternatives. It will help you engage students of all ages – even those learning to read – with a wide range of topics.",
        "content":"Now, in addition to text, you can use images as answer alternatives. By providing you with an <b>alternative to words</b>, Kahoot! becomes a great tool for teaching young students who are still learning to read and students who struggle with text. What’s more, images as answers opens up a world of possibilities for K-12 and higher education teachers. For example, math teachers can now easily quiz their students on everything from equations to graphs! <br /> <h1>Where this new feature can be useful</h1> Images as answers will bring a <b>new level of instruction</b> and fun to different subjects. It allows you to instruct a broader group of learners and lets: <br /> <ol> <li> Math teachers <b>explain graphs and fractions</b> in a more interactive way </li> <li> Language teachers use image answers to <b>connect words</b> with the correct image </li> <li> Geography teachers use images as answers to <b> highlight different landmarks</b> </li> <li> Music teachers help students <b>memorize musical notes</b> </li> <li> Special education teachers <b>engage with students</b> of all reading levels </li> </ol> <img src='https://kahoot.com/files/2020/03/Images-as-answers.png' width='100%' /> <br /> <h1>How do images work as answers?</h1> The ability to use images as answer alternatives is a free feature for all teachers. Click <b>Create</b> in the top navigation bar and choose <b>New kahoot</b>. Start adding your quiz or poll question and upload images as answer alternative tiles. You can even mix it up by having a blend of images and text answer alternatives in one question. <br /> <h1> Here’s a quick guide on how to add images to answer alternatives: </h1> <ul> <li> Click <b>Create</b> and choose either a <b>quiz</b> or <b> poll</b> question type </li> <li>Hover over the answer alternative and <b> click the small image</b> icon </li> <li> Upload or drag and drop an image from your desktop or use an image from our library </li> </ul> When you host a kahoot live, the images are displayed on the big screen in a color tile while the players’ devices just display the colored tiles. If you play a kahoot as a challenge, players see the question and images on their computers or mobile devices. <br /> <img src='https://kahoot.com/files/2020/03/Images-as-answers-blog-gif.gif' width='100%' /> <br /> Read more on how to <a href=''> <b> <u> play Kahoot! as a student-paced challenge </u> </b> </a> or how to <a href=''> <b> <u> host Kahoot! via video conferencing</u> </b> </a> . <br /> Get in touch with us on <a href=''> <b> <u> Twitter</u> </b> </a> , as we’d love to hear what you think of images as answers and how you’ll use them!"
    } 
] 